* Description
A website domain like "discuss.leetcode.com" consists of various subdomains. At the top level, we have "com", at the next level, we have "leetcode.com", and at the lowest level, "discuss.leetcode.com". When we visit a domain like "discuss.leetcode.com", we will also visit the parent domains "leetcode.com" and "com" implicitly.

Now, call a "count-paired domain" to be a count (representing the number of visits this domain received), followed by a space, followed by the address. An example of a count-paired domain might be "9001 discuss.leetcode.com".

We are given a list cpdomains of count-paired domains. We would like a list of count-paired domains, (in the same format as the input, and in any order), that explicitly counts the number of visits to each subdomain.
* Solutions
#+BEGIN_SRC cpp
  #include <iostream>
  #include <map>
  #include <sstream>
  #include <vector>
  using namespace std;

  class Solution {
  public:
    vector<string> subdomainVisits(vector<string> &cpdomains) {
      map<string, int> res;
      for (string temp : cpdomains) {
        string domain, count;
        istringstream iss(temp);
        iss >> count;
        iss >> domain;
        if (res.count(domain) == 0) {
          res[domain] = stoi(count);
        } else {
          res[domain] += stoi(count);
        }
        size_t found;
        while (true) {
          found = domain.find('.');
          if (found == string::npos)
            break;
          domain.erase(0, found + 1);
          if (res.count(domain) == 0) {
            res[domain] = stoi(count);
          } else {
            res[domain] += stoi(count);
          }
        }
      }
      vector<string> rv;
      for (auto &t : res) {
        ostringstream stream;
        stream << t.second << " " << t.first;
        rv.push_back(stream.str());
      }
      return rv;
    }
  };

  int main(int argc, char *argv[]) {
    vector<string> test = {"9001 discuss.leetcode.com"};
    Solution solution = Solution();
    test = solution.subdomainVisits(test);
    for (auto &s : test) {
      cout << s << endl;
    }
    return 0;
  }
#+END_SRC

#+RESULTS:
| 9001 | com                  |
| 9001 | discuss.leetcode.com |
| 9001 | leetcode.com         |
